import View from "./View.js";

export default class extends View {
    constructor() {
        super(); 
        this.setTitle("");
    }

    async getHtml() {
        return `
            <h1>Βιογραφία Καταγωγή</h1>
            <p>
            Ο Νότης Σφακιανάκης γεννήθηκε στο Ηράκλειο της Κρήτης από πατέρα Κρητικό (Κωνσταντίνος)
            και μητέρα Μικρασιάτισσα (Δέσποινα). Σε ηλικία 7 ετών, λόγω του
            χωρισμού των γονιών του, εγκαταστάθηκε στην Κω όπου ζούσαν οι
            γονείς της μητέρας του, ενώ πέρασε κάποια μικρά χρονικά διαστήματα
            στη Γερμανία όπου είχε εγκατασταθεί η μητέρα του μετά τον δεύτερο γάμο της
            </p>
        `;
    }
}